Revit 2027 API
ReferencePoint.GetCoordinatePlaneReferenceXY Method
A reference for the XY plane of the coordinate system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Reference GetCoordinatePlaneReferenceXY()
Public Function GetCoordinatePlaneReferenceXY As Reference
public:
Reference^ GetCoordinatePlaneReferenceXY()
member GetCoordinatePlaneReferenceXY : unit -> Reference
Return Value
Reference
See Also
Reference
ReferencePoint Class
Autodesk.Revit.DB Namespace